// pages/act_sign_up/act_sign_up.js
var util = require('../../utils/time1.js')
var common = require('../../utils/time.js')
let randomLen=4
Page({

  /**
   * 页面的初始数据
   */
  data:{
  nowDate:'',
    xinDate:'',
    date:'',
    city: '',//存放地区
    station: '',//存放维修站
    perList:'',// 存放维修人员
    multiArray: [[], [], []],
    multiIndex: [0, 0, 0],
    sex:[
      {name:"男",value:"男"},
      {name:"女",value:"女"}
    ],
    //,checked:'true'
  },

  getCityStationPer:function(){
    let that=this
    that.setData({
      city: ['--','化生院', '土环院','马院','人文院','外院','美院','电信院','传媒院','体院','理学院','经管院','旅文院','音舞院','国学院'],//存放地区
      station: { 
        '--':['--'],
        '化生院': ['化学(师范)', '生物工程', '食品质量与安全', '生物技术', '生物技术(师范)','制药工程','材料化学'], 
        '土环院': ['工程管理', '土木工程', '测绘工程','建筑学'], 
        '马院': ['思想政治教育（师范）'],
        '人文院': ['汉语言文学（师范）', '秘书学', '法学','预科'],
        '外院':['英语（师范）', '商务英语', '日语'],
        '美院':['美术学', '视觉传达设计', '环境设计','产品设计'],
        '电信院':['电子信息工程', '电子科学与技术', '计算机科学与技术','通信工程','软件工程','数据科学与大数据技术','机械设计制造及自动化','教育技术'],
        '传媒院':['广告学', '广播电视学', '广播电视编导','数字媒体技术'],
        '体院':['体育教育（师范）'],
        '理学院':['数学与应用数学（师范）', '信息与计算科学', '物理学（师范）'],
        '经管院':['国际经济与贸易', '市场营销', '金融工程','财务管理'],
        '旅文院':['旅游管理', '文化产业管理', '航空服务艺术与管理'],
        '音舞院':['音乐学', '舞蹈学'],
        '国学院':['汉语言文学（国学）']
      },//存放维修站
      //perList: { '香洲站': ['李工', '王工'], '前山站': ['赵工', '钱工'], '白云机场': ['维修人员1', '维修人员2'], '天河区': ['天河区人员1', '天河区人员2'], '宝安机场': ['宝安机场1', '宝安机场2'] },// 存放维修人员
      perList:{
        '--':['--'],
        '化学(师范)':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '生物工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '食品质量与安全':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '生物技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '生物技术(师范)':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'制药工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'材料化学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], 
        '工程管理':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '土木工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '测绘工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'建筑学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], 
        '思想政治教育（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '汉语言文学（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '秘书学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'], '法学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'预科':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '英语（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '商务英语':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '日语':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '美术学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '视觉传达设计':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '环境设计':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '产品设计':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '电子信息工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '电子科学与技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'计算机科学与技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '通信工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '软件工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '数据科学与大数据技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '机械设计制造及自动化':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '教育技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '广告学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '广播电视学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '广播电视编导':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '数字媒体技术':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '体育教育（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '数学与应用数学（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '信息与计算科学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'物理学（师范）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '国际经济与贸易':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],'市场营销':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '金融工程':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '财务管理':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '旅游管理':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '文化产业管理':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '航空服务艺术与管理':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '音乐学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '舞蹈学':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704'],
        '汉语言文学（国学）':['2001','2002','2003','2004','1901','1902','1903','1904','1801','1802','1803','1804','1701','1702','1703','1704']
       }
    })
    that.data.multiArray[0] = that.data.city
    that.data.multiArray[1] = this.getArr(that.data.city[0], that.data.station);
    that.data.multiArray[2] = this.getArr(that.data.multiArray[1][0], that.data.perList);
    that.setData({
      multiArray: that.data.multiArray
    })
  },

  bindMultiPickerColumnChange: function (e) {
    let that=this
    console.log('修改的列为', e.detail.column, '，值为', e.detail.value);
    var data = {
      multiArray: this.data.multiArray,
      multiIndex: this.data.multiIndex
    };
    data.multiIndex[e.detail.column] = e.detail.value;
    switch (e.detail.column) {
      case 0:
        //第一列改变  设置第二列数据
        let arr = that.getArr(that.data.city[e.detail.value], that.data.station)
        data.multiArray[1]=arr
        that.setData({
          multiArray: data.multiArray
        })
        //从第二列中拿出第一项，设置第三组人员
        let arrColumn2 = that.getArr(arr[0], that.data.perList)
        data.multiArray[2] = arrColumn2
        that.setData({
          multiArray: data.multiArray
        })
        break;
      case 1:
         //第二列改变 设置第三列数据
        let arr2 = that.getArr(data.multiArray[1][e.detail.value], that.data.perList)
        data.multiArray[2] = arr2
        that.setData({
          multiArray: data.multiArray
        })
        break;
    }
  },

  getArr:function(value,arr){
    for (let i in arr) {
      if (value == i) {
        return arr[i]
      }
    }
  },

  /****值发生改变 */
  bindMultiPickerChange: function (e) {
    this.setData({
      multiIndex: e.detail.value,
      bj:e.detail.value
    })
    let xy=this.data.city[this.data.bj[0]];
    let marjor=this.data.station[xy][this.data.bj[1]]
    let banji=this.data.perList[marjor][this.data.bj[2]]
    console.log(xy,marjor,banji)
    let bjclass=xy+marjor+banji
    console.log(bjclass)
    this.setData({
      bjclass:bjclass
    })
  },

  radioChange:function(e){
    console.log(e.detail.value)
    this.setData({
      xingbie:e.detail.value
    })
  },

  formSubmit:function(res){
    let nowDate= common.formatDate(new Date())
    this.setData({
      nowDate: common.formatDate(new Date())
    })
    //console.log(nowDate)
    var xinDate = util.formatTime(new Date());
    this.setData({
      xinDate: util.formatTime(new Date())
    });
    //console.log(xinDate)
    var str = xinDate;
    let ctime=str.replace(/[^0-9]/gi, "")
    console.log(str.replace(/[^0-9]/gi, ""));
    var random_no = "";
    for (var i = 0; i < randomLen; i++)
    {
      random_no += Math.floor(Math.random() * 10);
    }
    random_no = ctime + "-" + random_no;


    //wx.cloud.database().collection('20201217').where({
    wx.cloud.database().collection('activity_sign_up').where({
      _openid:this.openid,
      activity_id:this.data.act_database
    }).get().then(ress => {
      if(ress.data.length==0){
        var phone=res.detail.value.phone;
        var name=res.detail.value.name;
        let act_name=this.data.act_name

        if(res.detail.value.name==""){
          wx.showToast({
            title: '小浪花，你好像还没有填写姓名哦！',
            duration: 2000,
            icon:'none'
          })
        }
        else if(this.data.xingbie==undefined){
          wx.showToast({
            title: '小浪花，你是不是忘记填写性别了呀！',
            duration: 2000,
            icon:'none'
          })
        }
        else if(this.data.bjclass==undefined){
          wx.showToast({
            title: '小浪花，请告诉我你的班级哦，不然重名了我就分不清了~',
            duration: 2000,
            icon:'none'
          })
        }
        else if(res.detail.value.phone==""){
          wx.showToast({
            title: '亲，请填写你的联系方式，我们怕你在活动过程中找不着路了*……*',
            duration: 2000,
            icon:'none'
          })
        }
        else{
        
        //数据库中新增记录
          //wx.cloud.database().collection('20201217').add({
          wx.cloud.database().collection('activity_sign_up').add({
            data:{
              name:name,
              phone:phone,
              state:"0",
              state_text:"已报名_未签到",
              sex:this.data.xingbie,
              activity_name:act_name,
              bj:this.data.bj,
              bjclass:this.data.bjclass,
              signuptime:nowDate,
              activity_id:this.data.act_database,
              sign_up_id:random_no,
              appraise_state:"0",
              activity_date:this.data.activity_date,
              opid:this.openid
            },
          success: resss => {
            console.log('报名成功！', resss)
            console.log(this.data.act_database)
            let actid=this.data.act_database
            wx.showToast({
              title: '报名成功！',
              icon: 'success',
              duration: 2000,
              success:function(){ 
                setTimeout(function () {
                  wx.redirectTo({
                    //url: '/pages/act_bm_list/act_bm_list',
                    url:'/pages/act_sign_up_result/act_sign_up_result?activity_name='+ act_name +'&activity_id='+ actid + '&sign_up_id='+random_no,
                  })
                  // wx.navigateTo({
                  //   url: '/pages/act_bm_list/act_bm_list',
                  // })
                 }, 2000) 
             }        
            })
          },
          fail: error => {
            console.error('报名失败！', error)
            wx.showToast({
              title: '报名失败！',
              icon: 'success',
              duration: 2000,})
          }
        })}
        
        // 用户已经存在数据库中，可以直接跳转到主界面
      }else{
        console.log("用户已经报名")
        wx.showModal({
          title: '提示',
          content: '亲，您已经报名过本活动了哦！',
        })
      }
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: async function (options) {
    console.log(options)
    this.setData({
      act_name:options.name,
      act_database:options.act_id,
      activity_date:options.acttime
    })
    console.log(this.data.act_database)
    this.getCityStationPer();
    console.log(this.openid = await getApp().getCloudOpenid());
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    wx.setNavigationBarTitle({
      title: this.data.act_name+"活动报名"
    })
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})